Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/stm32f4x.c
#pragma weak NMI_IRQHandler = Default_IRQHandler
#pragma weak MemManage_IRQHandler = Default_IRQHandler
#pragma weak BusFault_IRQHandler = Default_IRQHandler
#pragma weak UsageFault_IRQHandler = Default_IRQHandler
#pragma weak SVC_IRQHandler = Default_IRQHandler
#pragma weak DebugMon_IRQHandler = Default_IRQHandler
#pragma weak PendSV_IRQHandler = Default_IRQHandler
#pragma weak SysTick_IRQHandler = Default_IRQHandler
#pragma weak WWDG_IRQHandler =                                                 \
    Default_IRQHandler /*!< Window WatchDog Interrupt */
#pragma weak PVD_IRQHandler =                                                  \
    Default_IRQHandler /*!< PVD through EXTI Line detection Interrupt */
#pragma weak TAMP_STAMP_IRQHandler =                                           \
    Default_IRQHandler /*!< Tamper and TimeStamp interrupts through the EXTI   \
                          line             */
#pragma weak RTC_WKUP_IRQHandler =                                             \
    Default_IRQHandler /*!< RTC Wakeup interrupt through the EXTI line */
#pragma weak FLASH_IRQHandler =                                                \
    Default_IRQHandler                           /*!< FLASH global Interrupt */
#pragma weak RCC_IRQHandler = Default_IRQHandler /*!< RCC global Interrupt */
#pragma weak EXTI0_IRQHandler =                                                \
    Default_IRQHandler /*!< EXTI Line0 Interrupt */
#pragma weak EXTI1_IRQHandler =                                                \
    Default_IRQHandler /*!< EXTI Line1 Interrupt */
#pragma weak EXTI2_IRQHandler =                                                \
    Default_IRQHandler /*!< EXTI Line2 Interrupt */
#pragma weak EXTI3_IRQHandler =                                                \
    Default_IRQHandler /*!< EXTI Line3 Interrupt */
#pragma weak EXTI4_IRQHandler =                                                \
    Default_IRQHandler /*!< EXTI Line4 Interrupt */
#pragma weak DMA1_Stream0_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA1 Stream 0 global Interrupt */
#pragma weak DMA1_Stream1_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA1 Stream 1 global Interrupt */
#pragma weak DMA1_Stream2_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA1 Stream 2 global Interrupt */
#pragma weak DMA1_Stream3_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA1 Stream 3 global Interrupt */
#pragma weak DMA1_Stream4_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA1 Stream 4 global Interrupt */
#pragma weak DMA1_Stream5_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA1 Stream 5 global Interrupt */
#pragma weak DMA1_Stream6_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA1 Stream 6 global Interrupt */
#pragma weak ADC_IRQHandler =                                                  \
    Default_IRQHandler /*!< ADC1, ADC2 and ADC3 global Interrupts */
#pragma weak CAN1_TX_IRQHandler = Default_IRQHandler /*!< CAN1 TX Interrupt */
#pragma weak CAN1_RX0_IRQHandler =                                             \
    Default_IRQHandler /*!< CAN1 RX0 Interrupt */
#pragma weak CAN1_RX1_IRQHandler =                                             \
    Default_IRQHandler /*!< CAN1 RX1 Interrupt */
#pragma weak CAN1_SCE_IRQHandler =                                             \
    Default_IRQHandler /*!< CAN1 SCE Interrupt */
#pragma weak EXTI9_5_IRQHandler =                                              \
    Default_IRQHandler /*!< External Line[9:5] Interrupts */
#pragma weak TIM1_BRK_TIM9_IRQHandler =                                        \
    Default_IRQHandler /*!< TIM1 Break interrupt and TIM9 global interrupt */
#pragma weak TIM1_UP_TIM10_IRQHandler =                                        \
    Default_IRQHandler /*!< TIM1 Update Interrupt and TIM10 global interrupt   \
                        */
#pragma weak TIM1_TRG_COM_TIM11_IRQHandler =                                   \
    Default_IRQHandler /*!< TIM1 Trigger and Commutation Interrupt and TIM11   \
                          global interrupt */
#pragma weak TIM1_CC_IRQHandler =                                              \
    Default_IRQHandler /*!< TIM1 Capture Compare Interrupt */
#pragma weak TIM2_IRQHandler =                                                 \
    Default_IRQHandler /*!< TIM2 global Interrupt */
#pragma weak TIM3_IRQHandler =                                                 \
    Default_IRQHandler /*!< TIM3 global Interrupt */
#pragma weak TIM4_IRQHandler =                                                 \
    Default_IRQHandler /*!< TIM4 global Interrupt */
#pragma weak I2C1_EV_IRQHandler =                                              \
    Default_IRQHandler /*!< I2C1 Event Interrupt */
#pragma weak I2C1_ER_IRQHandler =                                              \
    Default_IRQHandler /*!< I2C1 Error Interrupt */
#pragma weak I2C2_EV_IRQHandler =                                              \
    Default_IRQHandler /*!< I2C2 Event Interrupt */
#pragma weak I2C2_ER_IRQHandler =                                              \
    Default_IRQHandler /*!< I2C2 Error Interrupt */
#pragma weak SPI1_IRQHandler =                                                 \
    Default_IRQHandler /*!< SPI1 global Interrupt */
#pragma weak SPI2_IRQHandler =                                                 \
    Default_IRQHandler /*!< SPI2 global Interrupt */
#pragma weak USART1_IRQHandler =                                               \
    Default_IRQHandler /*!< USART1 global Interrupt */
#pragma weak USART2_IRQHandler =                                               \
    Default_IRQHandler /*!< USART2 global Interrupt */
#pragma weak USART3_IRQHandler =                                               \
    Default_IRQHandler /*!< USART3 global Interrupt */
#pragma weak EXTI15_10_IRQHandler =                                            \
    Default_IRQHandler /*!< External Line[15:10] Interrupts */
#pragma weak RTC_Alarm_IRQHandler =                                            \
    Default_IRQHandler /*!< RTC Alarm (A and B) through EXTI Line Interrupt */
#pragma weak OTG_FS_WKUP_IRQHandler =                                          \
    Default_IRQHandler /*!< USB OTG FS Wakeup through EXTI line interrupt */
#pragma weak TIM8_BRK_TIM12_IRQHandler =                                       \
    Default_IRQHandler /*!< TIM8 Break Interrupt and TIM12 global interrupt */
#pragma weak TIM8_UP_TIM13_IRQHandler =                                        \
    Default_IRQHandler /*!< TIM8 Update Interrupt and TIM13 global interrupt   \
                        */
#pragma weak TIM8_TRG_COM_TIM14_IRQHandler =                                   \
    Default_IRQHandler /*!< TIM8 Trigger and Commutation Interrupt and TIM14   \
                          global interrupt */
#pragma weak TIM8_CC_IRQHandler =                                              \
    Default_IRQHandler /*!< TIM8 Capture Compare global interrupt */
#pragma weak DMA1_Stream7_IRQHandler =                                         \
    Default_IRQHandler                           /*!< DMA1 Stream7 Interrupt */
#pragma weak FMC_IRQHandler = Default_IRQHandler /*!< FMC global Interrupt */
#pragma weak SDIO_IRQHandler =                                                 \
    Default_IRQHandler /*!< SDIO global Interrupt */
#pragma weak TIM5_IRQHandler =                                                 \
    Default_IRQHandler /*!< TIM5 global Interrupt */
#pragma weak SPI3_IRQHandler =                                                 \
    Default_IRQHandler /*!< SPI3 global Interrupt */
#pragma weak UART4_IRQHandler =                                                \
    Default_IRQHandler /*!< UART4 global Interrupt */
#pragma weak UART5_IRQHandler =                                                \
    Default_IRQHandler /*!< UART5 global Interrupt */
#pragma weak TIM6_DAC_IRQHandler =                                             \
    Default_IRQHandler /*!< TIM6 global and DAC1&2 underrun error  interrupts  \
                        */
#pragma weak TIM7_IRQHandler =                                                 \
    Default_IRQHandler /*!< TIM7 global interrupt */
#pragma weak DMA2_Stream0_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA2 Stream 0 global Interrupt */
#pragma weak DMA2_Stream1_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA2 Stream 1 global Interrupt */
#pragma weak DMA2_Stream2_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA2 Stream 2 global Interrupt */
#pragma weak DMA2_Stream3_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA2 Stream 3 global Interrupt */
#pragma weak DMA2_Stream4_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA2 Stream 4 global Interrupt */
#pragma weak ETH_IRQHandler =                                                  \
    Default_IRQHandler /*!< Ethernet global Interrupt */
#pragma weak ETH_WKUP_IRQHandler =                                             \
    Default_IRQHandler /*!< Ethernet Wakeup through EXTI line Interrupt */
#pragma weak CAN2_TX_IRQHandler = Default_IRQHandler /*!< CAN2 TX Interrupt */
#pragma weak CAN2_RX0_IRQHandler =                                             \
    Default_IRQHandler /*!< CAN2 RX0 Interrupt */
#pragma weak CAN2_RX1_IRQHandler =                                             \
    Default_IRQHandler /*!< CAN2 RX1 Interrupt */
#pragma weak CAN2_SCE_IRQHandler =                                             \
    Default_IRQHandler /*!< CAN2 SCE Interrupt */
#pragma weak OTG_FS_IRQHandler =                                               \
    Default_IRQHandler /*!< USB OTG FS global Interrupt */
#pragma weak DMA2_Stream5_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA2 Stream 5 global interrupt */
#pragma weak DMA2_Stream6_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA2 Stream 6 global interrupt */
#pragma weak DMA2_Stream7_IRQHandler =                                         \
    Default_IRQHandler /*!< DMA2 Stream 7 global interrupt */
#pragma weak USART6_IRQHandler =                                               \
    Default_IRQHandler /*!< USART6 global interrupt */
#pragma weak I2C3_EV_IRQHandler =                                              \
    Default_IRQHandler /*!< I2C3 event interrupt */
#pragma weak I2C3_ER_IRQHandler =                                              \
    Default_IRQHandler /*!< I2C3 error interrupt */
#pragma weak OTG_HS_EP1_OUT_IRQHandler =                                       \
    Default_IRQHandler /*!< USB OTG HS End Point 1 Out global interrupt */
#pragma weak OTG_HS_EP1_IN_IRQHandler =                                        \
    Default_IRQHandler /*!< USB OTG HS End Point 1 In global interrupt */
#pragma weak OTG_HS_WKUP_IRQHandler =                                          \
    Default_IRQHandler /*!< USB OTG HS Wakeup through EXTI interrupt */
#pragma weak OTG_HS_IRQHandler =                                               \
    Default_IRQHandler /*!< USB OTG HS global interrupt */
#pragma weak DCMI_IRQHandler =                                                 \
    Default_IRQHandler /*!< DCMI global interrupt */
#pragma weak CRYP_IRQHandler =                                                 \
    Default_IRQHandler /*!< CRYP crypto global interrupt */
#pragma weak HASH_RNG_IRQHandler =                                             \
    Default_IRQHandler /*!< Hash and Rng global interrupt */
#pragma weak FPU_IRQHandler = Default_IRQHandler /*!< FPU global interrupt */
#pragma weak UART7_IRQHandler =                                                \
    Default_IRQHandler /*!< UART7 global interrupt */
#pragma weak UART8_IRQHandler =                                                \
    Default_IRQHandler /*!< UART8 global interrupt */
#pragma weak SPI4_IRQHandler =                                                 \
    Default_IRQHandler /*!< SPI4 global Interrupt */
#pragma weak SPI5_IRQHandler =                                                 \
    Default_IRQHandler /*!< SPI5 global Interrupt */
#pragma weak SPI6_IRQHandler =                                                 \
    Default_IRQHandler /*!< SPI6 global Interrupt */
#pragma weak SAI1_IRQHandler =                                                 \
    Default_IRQHandler /*!< SAI1 global Interrupt */
#pragma weak LTDC_IRQHandler =                                                 \
    Default_IRQHandler /*!< LTDC global Interrupt */
#pragma weak LTDC_ER_IRQHandler =                                              \
    Default_IRQHandler /*!< LTDC Error global Interrupt */
#pragma weak DMA2D_IRQHandler =                                                \
    Default_IRQHandler /*!< DMA2D global Interrupt */
#pragma weak QUADSPI_IRQHandler =                                              \
    Default_IRQHandler /*!< QUADSPI global Interrupt */
#pragma weak DSI_IRQHandler = Default_IRQHandler /*!< DSI global Interrupt */

void Default_IRQHandler(void) {
  while (1) {
  }
}

#endif
